Tekla Open API Reference for Tekla Structures 2025
Events.SelectionChange Event
 The SelectionChange event is raised when the user changes the current selection inside Tekla Structures.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public event Events.SelectionChangeDelegate SelectionChange
Public Event SelectionChange As Events.SelectionChangeDelegate
Value
Type: Tekla.Structures.Model.Events.SelectionChangeDelegate
Implements
IEvents.SelectionChange
See Also
Reference
Events Class
Tekla.Structures.Model Namespace